UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ed14c926-38a5-4a0b-b570-c106d8d9419d">
  <name>СтруктурныеЕдиницы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>саУНФ_КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_ФорматМагазина</name>
    <type>
      <types>CatalogRef.саУНФ_ФорматыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_ГрафикДоставки</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыМагазиновИФилиалов</types>
    </type>
  </attributes>
  <attributes>
    <name>AK_Филиал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b686b923-618b-447b-a283-0f23b5d8d988">
    <name>ТипСтруктурнойЕдиницы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2476bac7-ac47-4539-b1e8-e2d3bf18251a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a579788-8f60-4358-a54a-2a1b02be6ac8">
    <name>ИсточникПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="435125b2-101c-4eae-ad45-b084a33b0510">
    <name>РозничныйВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>саУНФ_ЛетнееРасписание</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыРТТ</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_ЗимнееРасписание</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыРТТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДоставки</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СезонЗима</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97b4ad24-7fe0-4089-81be-fde2f291bf9d">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="403e370d-5c7d-4010-93e7-ea8729e934a9">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="64ffead8-4404-4f60-8592-b4020b98da25">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6eaeb4e5-7d2d-492d-98cb-c3be6dba9e72">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="62c9addc-f9c5-4262-8192-a7d73e71f636">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="593279ce-6c0c-4900-9429-d5cb335b4d23">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0968bf2f-4915-4a51-baeb-24e37a11f128">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fd4a9e59-595c-4e13-b2e8-facee41c4a11">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/caУНФ_ФилиалыДляАвтозаказа/caУНФ_ФилиалыДляАвтозаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>caУНФ_ФилиалыДляАвтозаказа</name>
  <resources>
    <name>Включить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b4fd140b-4f87-4d31-b394-ba3eeae7026c">
  <name>ТипыСтруктурныхЕдиниц</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="86426cf8-824c-479b-96ad-7dc1a16c73ba">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1b04bee5-2b2a-4bfe-b2f0-acf30a72c111">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Catalogs/СтруктурныеЕдиницы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура саУНФ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Объект.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
		
		ПолеВвода = Элементы.Добавить(
				"КонтролироватьАссортимент",
				Тип("ПолеФормы"),
				ЭтаФорма.Элементы["ГруппаРеквизиты"]);
				
		ПолеВвода.Заголовок = "Контролировать ассортимент(са)";
		ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеВвода.ЦветТекстаЗаголовка = Новый Цвет(0,0,255);
		
		ПолеВвода.ПутьКДанным = "Объект.саУНФ_КонтролироватьАссортимент";
		ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииКонролироватьАссортимент");
		
		ПолеВвода = Элементы.Добавить(
				"ФорматМагазина",
				Тип("ПолеФормы"),
				ЭтаФорма.Элементы["ГруппаРеквизиты"]);
				
		ПолеВвода.Заголовок = "Формат магазина(са)";
		ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеВвода.ЦветТекстаЗаголовка = Новый Цвет(0,0,255);
		
		ПолеВвода.ПутьКДанным = "Объект.саУНФ_ФорматМагазина";
		
		Элементы.ФорматМагазина.Доступность = Объект.саУНФ_КонтролироватьАссортимент;
		
		//***Начало***17.05.2021***МурашкоВ
		#Область ДобавлениеЭлементовФормы
		ГруппаФормы = Элементы.Тип;
		// Элементы
		
		НовыйЭлемент = Элементы.Добавить("AK_Филиал", Тип("ПолеФормы"), ГруппаФормы);
		НовыйЭлемент.ПутьКДанным                    =   "Объект.AK_Филиал";
		НовыйЭлемент.Вид                            =   ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр                 =   Ложь;
		НовыйЭлемент.Подсказка                      =   "С этого склада снабжаются РТТ";
		НовыйЭлемент.ОтображениеПодсказки           =   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             =   ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.УстановитьДействие(
		"ПриИзменении", 		    //Имя события
		"ПриИзмененииФилиала"); //Имя процедуры обработчика
		
		
		Если Параметры.Ключ.Пустая() ИЛИ Объект.ТипСтруктурнойЕдиницы<>Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
			НовыйЭлемент.Доступность = Ложь;
		Иначе	
			НовыйЭлемент.Доступность = Истина;
		КонецЕсли;	
		//--------------------------------------------------------------
		ГруппаФормы = Элементы.ГруппаРеквизиты;
		
		НовыйЭлемент = Элементы.Добавить("саУНФ_ЛетнееРасписание", Тип("ПолеФормы"), ГруппаФормы);
		НовыйЭлемент.ПутьКДанным                    		=   "Объект.саУНФ_ЛетнееРасписание";
		НовыйЭлемент.Вид                           				=   ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр                 	=   Ложь;
		НовыйЭлемент.Подсказка                      			=   "Летнее расписание магазина";
		НовыйЭлемент.ОтображениеПодсказки       	=   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             =   ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.ЦветТекстаЗаголовка			=	 Новый Цвет(0,0,255);
	
		
		Если Параметры.Ключ.Пустая() ИЛИ Объект.ТипСтруктурнойЕдиницы<>Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
			НовыйЭлемент.Доступность = Ложь;
		Иначе	
			НовыйЭлемент.Доступность = Истина;
		КонецЕсли;	

		НовыйЭлемент = Элементы.Добавить("саУНФ_СезонЗима", Тип("ПолеФормы"), ГруппаФормы);
		НовыйЭлемент.ПутьКДанным                    		=   "Объект.саУНФ_СезонЗима";
		НовыйЭлемент.Вид                           				=   ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ТолькоПросмотр                 		=   Ложь;
		НовыйЭлемент.Подсказка                      			=   "Если стоит флажок, то сезон зима";
		НовыйЭлемент.ОтображениеПодсказки       		=   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             	=   ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.ЦветТекстаЗаголовка					=	 Новый Цвет(0,0,255);
        Если Объект.саУНФ_СезонЗима  Тогда
		       НовыйЭлемент.Заголовок		=	"Сезон: ЗИМА";
		Иначе
		       НовыйЭлемент.Заголовок		=	"Сезон: ЛЕТО";
		КонецЕсли;
		
		Если Параметры.Ключ.Пустая() ИЛИ Объект.ТипСтруктурнойЕдиницы<>Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
			НовыйЭлемент.Доступность = Ложь;
		Иначе	
			НовыйЭлемент.Доступность = Истина;
		КонецЕсли;	

		НовыйЭлемент = Элементы.Добавить("саУНФ_ЗимнееРасписание", Тип("ПолеФормы"), ГруппаФормы);
		НовыйЭлемент.ПутьКДанным                    		=   "Объект.саУНФ_ЗимнееРасписание";
		НовыйЭлемент.Вид                           				=   ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр                 	=   Ложь;
		НовыйЭлемент.Подсказка                      			=   "Зимнее расписание магазина";
		НовыйЭлемент.ОтображениеПодсказки       	=   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             =   ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.ЦветТекстаЗаголовка			=	 Новый Цвет(0,0,255);
	
		
		Если Параметры.Ключ.Пустая() ИЛИ Объект.ТипСтруктурнойЕдиницы<>Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
			НовыйЭлемент.Доступность = Ложь;
		Иначе	
			НовыйЭлемент.Доступность = Истина;
		КонецЕсли;	

		НовыйЭлемент = Элементы.Добавить("НаправлениеДоставки", Тип("ПолеФормы"), ГруппаФормы);
		НовыйЭлемент.ПутьКДанным                    		=   "Объект.НаправлениеДоставки";
		НовыйЭлемент.Вид                           				=   ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр                 	=   Ложь;
		НовыйЭлемент.Подсказка                      			=   "Логистическое направление доставки";
		НовыйЭлемент.ОтображениеПодсказки       	=   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             =   ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.ЦветТекстаЗаголовка			=	 Новый Цвет(0,0,255);

		
		
		// Элементы
		
		НовыйЭлемент = Элементы.Добавить("саУНФ_ГрафикДоставки", Тип("ПолеФормы"), ГруппаФормы);
		НовыйЭлемент.ПутьКДанным                    	=   "Объект.саУНФ_ГрафикДоставки";
		НовыйЭлемент.Вид                           			=   ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ТолькоПросмотр                 	=   Ложь;
		НовыйЭлемент.Подсказка                      		=   "По каким дням доставляется товар";
		НовыйЭлемент.ОтображениеПодсказки         =   ОтображениеПодсказки.Кнопка;
		НовыйЭлемент.ПоложениеЗаголовка             =   ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.ЦветТекстаЗаголовка				=	 Новый Цвет(0,0,255);
	
		
		Если Параметры.Ключ.Пустая() ИЛИ Объект.ТипСтруктурнойЕдиницы<>Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
			НовыйЭлемент.Доступность = Ложь;
		Иначе	
			НовыйЭлемент.Доступность = Истина;
		КонецЕсли;	

		
		 Элементы.ФорматМагазина.Доступность = ?(Объект.саУНФ_КонтролироватьАссортимент, Объект.саУНФ_КонтролироватьАссортимент, Объект.AK_Филиал);
		
		#КонецОбласти
		//***Конец***17.05.2021***МурашкоВ
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонролироватьАссортимент()

	ПриИзмененииКонтролироватьАссортиментНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтролироватьАссортиментНаСервере()

	Элементы.ФорматМагазина.Доступность = Объект.саУНФ_КонтролироватьАссортимент;
	    	
КонецПроцедуры // ПриИзмененииКонтролироватьАссортиментНаСервере()

//***Начало***17.05.2021***МурашкоВ
&НаСервере
Процедура ПриИзмененииФилиалаНаСервере()
    Если Объект.ТипСтруктурнойЕдиницы<>Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Филиал может быть только у структурной единицы с типом склад";
        Сообщение.Поле = "Объект.ТипСтруктурнойЕдиницы";
        Сообщение.Сообщить();
        
        Возврат;
    КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.caУНФ_ФилиалыДляАвтозаказа.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Филиал.Установить(Объект.Ссылка);
    НаборЗаписей.Прочитать();
    Если НаборЗаписей.Количество()>0 Тогда
        Для каждого Запись Из НаборЗаписей Цикл
            Запись.Включить     =   Объект.AK_Филиал;
        КонецЦикла; 
    ИначеЕсли Объект.AK_Филиал Тогда
        Запись = НаборЗаписей.Добавить();
        Запись.Филиал         =   Объект.Ссылка;
        Запись.Включить       =   Объект.AK_Филиал;
    КонецЕсли; 
    Попытка
        
    Если НаборЗаписей.Количество()>0 Тогда
        НаборЗаписей.Записать();
    КонецЕсли;     
    Если ПривилегированныйРежим() Тогда    
	УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
   Исключение
	   Если ПривилегированныйРежим() Тогда    
		   УстановитьПривилегированныйРежим(Ложь);
	   КонецЕсли;

        Описание=ОписаниеОшибки();

		саУНФ_АтозаказВызовСервера.ЗаписьОшибкиВЖурнал("Установка флажка Филиал",Объект.Ссылка,Объект.Ссылка,Описание);
		
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = Описание;
        Сообщение.Сообщить();
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФилиала(Элемент)
    Если Параметры.Ключ.Пустая() Тогда
        Режим = РежимДиалогаВопрос.ДаНет;
        Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
        ПоказатьВопрос(Оповещение, НСтр("ru = 'Перед установкой филиала нужно записать элемент справочника. Хотите записать?';"
        + " en = 'Do you want to save?'"), Режим, 0);
    Иначе
        ПриИзмененииФилиалаНаСервере();
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        Элементы.AK_Филиал.Доступность = Истина;
        Записать();
        ПриИзмененииФилиалаНаСервере();
    Иначе
        Элементы.AK_Филиал.Доступность = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура саУНФ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ТипСтруктурнойЕдиницы=Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
        ЭтаФорма.Элементы.AK_Филиал.Доступность = Истина;
    КонецЕсли; 

КонецПроцедуры

//***Конец***17.05.2021***МурашкоВ
